import 'package:ti_bank/data/models/new.dart';

class Constants {
  static const String isOnBoardingShowedKey = 'isOnBoardingShowedKey';
  static const String cachedIncomesKey = 'cachedIncomesKey';

  static final New mainNew = New(
    title: 'ЦБ одобрил открытие филиалов Альфа-банка в Китае',
    text:
        "Банк России одобрил открытие двух филиалов Альфа-банка в Китае, теперь работа на стороне китайского регулятора, заявил главный управляющий директор кредитной организации Владимир Верхошинский, выступая на форуме 'Сделано в России'.\n\n'Мы сейчас идем по пути открытия филиалов в Китае — в Шанхае как бизнес столице и Пекине как политической столице. Нам Центральный банк наш российский одобрил только что открытие этих двух филиалов, и за это Центральному банку отдельное спасибо. И особенно спасибо, что они подошли к этому супер небюрократично, мы сэкономили три месяца плановой процедуры. Так что теперь работа на стороне китайского регулятора', — сказал он.",
    dateTime: DateTime(2023, 10, 20),
    imageUrl: 'https://cdnn.1prime.ru/images/82952/76/829527666.jpg',
  );

  static final List<New> news = [
    New(
      title: 'Запасы золота в резервах ЦБ не изменились за сентябрь',
      text:
          "Запасы монетарного золота в международных резервах РФ за сентябрь не изменились и на 1 октября 2023 года остались прежними, как месяц назад – 75,0 миллиона унций (2332,76 тонны), свидетельствуют материалы Банка России.\n\nПри этом стоимость золота в резервах за сентябрь 2023 года снизилась на 2,9% — до 140,499 миллиарда долларов на 1 октября с 144,738 миллиарда долларов на 1 сентября. Доля золота в международных резервах также снизилась до 24,69% с 24,88%.\n\nБанк России в марте текущего года возобновил публикацию данных об объемах золота в международных резервах РФ после годового перерыва.",
      dateTime: DateTime(2023, 10, 20),
      imageUrl: 'https://cdnn.1prime.ru/images/82970/89/829708931.jpg',
    ),
    New(
      title: 'ФАС снова оштрафовала "Почта банк" из-за ненадлежащей рекламы',
      text:
          'Федеральная антимонопольная служба (ФАС) России снова оштрафовала "Почта банк", на этот раз за продолжение демонстрации рекламы кредита, где пониженная ставка указана крупным шрифтом, но условия ее получения – мелким, хотя банк отчитался о выполнении соответствующего предписания, сообщила служба.\n\nРанее в октябре ФАС сообщала, что оштрафовала "Почта банк" на 500 тысяч рублей после жалобы гражданина на рекламу о кредите. В ней крупным шрифтом указывалась привлекательная информация о ставке по кредиту от четырех процентов. Однако данные об иных условиях, влияющих на стоимость кредита и возможность участия в акции (сумме, сроке, условии о заключении договора страхования и прочем), размещались в поясняющей сноске трудным для восприятия шрифтом в течение короткого времени, считает он.',
      dateTime: DateTime(2023, 10, 19),
      imageUrl: 'https://cdnn.1prime.ru/images/83443/94/834439419.jpg',
    ),
    New(
      title:
          'Страховщики призвали расширить действие проекта о вычетах по НДФЛ',
      text:
          'Всероссийский союз страховщиков (ВСС) предлагает включить в проект о вычетах по НДФЛ на долгосрочные сбережения граждан страхование жизни, говорится в сообщении союза.\n\nКак следует из базы данных нижней палаты парламента, правительство РФ внесло в Госдуму законопроект о ведении налоговых вычетов по НДФЛ на долгосрочные сбережения граждан.',
      dateTime: DateTime(2023, 10, 18),
      imageUrl: 'https://cdnn.1prime.ru/images/83366/22/833662276.jpg',
    ),
    New(
      title:
          'Эксперт объяснил, почему Индия может стать "новым Китаем" для России',
      text:
          'Индия обладает хорошим потенциалом, чтобы стать для России "новым Китаем", куда можно будет перемещать производство, рассказал агентству РИА Новости глава Индийского делового совета Акашдип Сингх.\n\n"Индия может стать новым Китаем. Об этом уже начали говорит достаточно давно, и если вы увидите все экономические показатели, то поймете, что все к этому и идет. Вопрос только в том, как скоро это произойдет — пять лет, 10 лет — но то, что так и случится — это 100 процентов", — сообщил эксперт в рамках экспортного форума "Сделано в России".',
      dateTime: DateTime(2023, 10, 18),
      imageUrl: 'https://cdnn.1prime.ru/images/84098/40/840984040.jpg',
    ),
    New(
      title: 'ЦБ выпускает в обращение памятные монеты "Аленький цветочек"',
      text:
          'Банк России выпускает в обращение памятные монеты "Аленький цветочек" серии "Российская (советская) мультипликация" разного номинала, сообщает регулятор.\n\n"Банк России 20 октября 2023 года выпускает в обращение памятные монеты "Аленький цветочек" серии "Российская (советская) мультипликация": серебряную номиналом 3 рубля, из стали с никелевым покрытием номиналом 25 рублей, из медно-никелевого сплава с цветным покрытием номиналом 25 рублей", — говорится в сообщении.',
      dateTime: DateTime(2023, 10, 17),
      imageUrl: 'https://cdnn.1prime.ru/images/84203/61/842036160.jpg',
    ),
    New(
      title:
          'Ozon принял решение провести делистинг с американской фондовой биржи Nasdaq',
      text:
          'МОСКВА, 20 окт — ПРАЙМ. Ozon принял решение провести делистинг своих американских депозитарных акции (ADS) с американской фондовой биржи Nasdaq и планирует до 30 октября подать форму, запускающую эту процедуру, сообщает компания.\n\n"Мы приняли решение о самостоятельном исключении бумаг с биржи, поскольку у нас нет оснований полагать, что торговля ADS Ozon на Nasdaq будет возобновлена. Дерегистрация позволит нам снизить затраты, связанные с предоставлением отчетности по американским стандартам", — говорится в сообщении.',
      dateTime: DateTime(2023, 10, 16),
      imageUrl: 'https://cdnn.1prime.ru/images/83253/33/832533349.jpg',
    ),
    New(
      title: 'Правительство может сделать валютный контроль постоянным',
      text:
          'Правительство России и ЦБ намерены внести новые элементы в систему частичного валютного контроля, сделав его постоянным для российских компаний, сообщает "Коммерсантъ".\n\nТакже Минфин готовит документ, согласно которому некоторые компании будут должны отчитываться о своих валютных активах и обязательствах за рубежом.\n\nУточняется, что перечисленные в списке указа экспортеры (всего их 43 группы компаний) обеспечат исполнение требований по валютной выручке своими дочерними компаниями, в том числе за границей.',
      dateTime: DateTime(2023, 10, 16),
      imageUrl: 'https://cdnn.1prime.ru/images/83864/46/838644644.jpg',
    ),
    New(
      title:
          'Правоохранители смогут получать в ЦБ сведения о дропперских счетах',
      text:
          'Сотрудники МВД России теперь смогут оперативно получать данные о мошенничестве в отношении клиентов банков, в том числе узнавать реквизиты дропперов – лиц, на счета которых выводятся украденные мошенниками деньги. Соответствующий закон об информационном обмене Банка России и правоохранителей вступит в силу с 21 октября.\n\n"Как будет происходить обмен? После обращения потерпевшего лица в правоохранительные органы, они смогут обратиться к автоматизированной системе и получить информацию о тех реквизитах, с помощью которых было совершено хищение и куда соответственно были выведены похищенные денежные средства", — приводится в сообщении Банка России комментарий главы директора департамента информационной безопасности ЦБ Вадима Уварова.',
      dateTime: DateTime(2023, 10, 15),
      imageUrl: 'https://cdnn.1prime.ru/images/84114/56/841145651.jpg',
    ),
    New(
      title:
          'Банки в сентябре нарастили кредитование компаний и населения, заявили в ЦБ',
      text:
          'Российские банки в сентябре ускорили корпоративное кредитование до 2% с 1,7% в августе, вместе с тем розничное кредитование, напротив, несколько замедлилось и выросло на 2,9%, следует из материалов Банка России.\n\n"Рост корпоративного портфеля ускорился до 2% после 1,7% в августе. Кредиты привлекали компании из многих отраслей, в том числе застройщики жилья. Кроме того, были профинансированы сделки по выходу нерезидентов из российских активов", — сказано в сообщении.',
      dateTime: DateTime(2023, 10, 14),
      imageUrl: 'https://cdnn.1prime.ru/images/84140/70/841407058.jpg',
    ),
    New(
      title: 'Выдачи ипотеки в России в сентябре побили рекорд августа',
      text:
          'Выдачи ипотеки в России в сентябре побили рекорд августа, достигнув 955 миллиардов рублей, кредитный портфель вырос за месяц на 4,2%, говорится в материалах Банка России.\n\n"По предварительным данным, ипотека снова побила рекорд. Прирост портфеля за сентябрь составил 4,2% (+3,7% в августе), а с начала года – 23,5%, что выше аналогичного показателя исключительного 2021 года (20,9%). По объему выдано 955 миллиардов рублей, на 12% больше, чем в августе (849 миллиардов рублей)", — сказано в материалах.',
      dateTime: DateTime(2023, 10, 13),
      imageUrl: 'https://cdnn.1prime.ru/images/84124/39/841243916.jpg',
    ),
    New(
      title:
          'В ЦБ отметили рост средств населения и компаний в банках в сентябре',
      text:
          'Средства населения в банках РФ выросли на 1% в сентябре, средства компаний увеличились на 0,7%, говорится в материалах Банка России.\n\n"В сентябре средства компаний выросли на 332 миллиарда рублей (+0,7%), главным образом в нефтегазовой, металлургической и энергетической отраслях. Прирост средств населения в сентябре незначительно ускорился по сравнению с августом – до 1,0% с 0,8%", — сказано в материалах.',
      dateTime: DateTime(2023, 10, 12),
      imageUrl: 'https://cdnn.1prime.ru/images/83864/46/838644644.jpg',
    ),
    New(
      title: 'В ЦБ раскрыли чистую прибыль банков в сентябре',
      text:
          'Чистая прибыль банков в России в сентябре снизилась на 16% по сравнению с августом и составила 296 миллиардов рублей, с начала года прибыль сектора достигла 2,7 триллиона рублей, говорится в материалах Банка России.\n\nЧистая прибыль сектора составила 296 миллиардов рублей (доходность на капитал – около 26% в годовом выражении), что на 16% ниже результата августа (353 миллиардов рублей). Основной фактор – сокращение доходов от валютной переоценки (до 8 миллиардов рублей с 106 миллиардов рублей в августе).',
      dateTime: DateTime(2023, 10, 11),
      imageUrl: 'https://cdnn.1prime.ru/images/84146/43/841464365.jpg',
    ),
    New(
      title:
          'Льготное кредитование распространили на строительство горнолыжных курортов',
      text:
          'Строительство инфраструктуры горнолыжных курортов, парков развлечений и аквапарков было включено в программу льготного кредитования, сообщает правительство России.\n\n"Правительство продолжает системную поддержку туристической отрасли. Принято решение расширить параметры программы выдачи льготных кредитов на реализацию инвестиционных проектов, направленных на развитие внутреннего и въездного туризма. Такое постановление подписал председатель правительства Михаил Мишустин", — говорится в сообщении.',
      dateTime: DateTime(2023, 10, 10),
      imageUrl: 'https://cdnn.1prime.ru/images/83940/97/839409708.jpg',
    ),
    New(
      title: 'Маск потерял 16 миллиардов долларов за сутки',
      text:
          'Американский предприниматель Илон Маск, владелец компаний Tesla и SpaceX, потерял за сутки 16 миллиардов долларов состояния после того, как акции Tesla упали в цене на 9%, свидетельствуют данные Bloomberg Billionaires Index (BBI).\n\nПо итогам последних торгов акции производителя электромобилей Tesla подешевели на 9,3%, до 220 долларов. Это произошло после того, как компания сообщила, что ее чистая прибыль упала почти в 1,8 раза по итогам прошлого квартала.',
      dateTime: DateTime(2023, 10, 9),
      imageUrl: 'https://cdnn.1prime.ru/images/84125/48/841254828.jpg',
    ),
  ];
}
